app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "1@1.com"], ["LIMIT", 1]]
---
    def create
      # puts "hit auth create"
      @user = User.find_by(email: user_login_params[:email])