app/controllers/roles_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def employees

    @users = User.all
    @user = User.find(params[:id])

    @users= @users.select{|employee| (employee.role == "emp" && employee.unit == @user.unit)}