app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("user_id", "emp_id", "title", "client", "notes", "description", "completed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", nil], ["updated_at", "2019-11-06 20:30:59.287642"], ["id", 1]]
---
  def update
    if @task.update(task_params)